// MITRE Technique: https://attack.mitre.org/techniques/T1222/ 
// MITRO Tactic:  Defense Evasion
// This is a sample comment
SecurityEvent
| where EventID == "4670"
| where ParentProcessFileName IN ("icacls.exe", "takedown.exe", "attrib.exe") 
or ParentProcessCommandline contains "grant"
| project ComputerName, UserName, IPAddress